## Basics on Pandas Data Frame

In [1]:
# Importing pandas library
import pandas as pd

1) How to import data from an excel into a Jupyter notebook.

In [2]:
df = pd.read_excel('./presidents_names.xlsx')
df

             Name       born  in office  in office.1
0    Jimmy C@rter 2024-01-10       1977       1981.0
1    Donald Trump 1946-06-14       2017          NaN
2  George W. Bush 1946-07-06       2001       2009.0
3    Bill Clinton 1946-08-19       1993       2001.0
4    Barack Obama 1961-08-04       2009       2017.0

In [6]:
xx = df.to_dict()
xx

{'Name': {0: 'Jimmy C@rter',
  1: 'Donald Trump',
  2: 'George W. Bush',
  3: 'Bill Clinton',
  4: 'Barack Obama'},
 'born': {0: Timestamp('2024-01-10 00:00:00'),
  1: Timestamp('1946-06-14 00:00:00'),
  2: Timestamp('1946-07-06 00:00:00'),
  3: Timestamp('1946-08-19 00:00:00'),
  4: Timestamp('1961-08-04 00:00:00')},
 'in office': {0: 1977, 1: 2017, 2: 2001, 3: 1993, 4: 2009},
 'in office.1': {0: 1981.0, 1: nan, 2: 2009.0, 3: 2001.0, 4: 2017.0}}

In [8]:
df = pd.DataFrame(xx)
df

             Name       born  in office  in office.1
0    Jimmy C@rter 2024-01-10       1977       1981.0
1    Donald Trump 1946-06-14       2017          NaN
2  George W. Bush 1946-07-06       2001       2009.0
3    Bill Clinton 1946-08-19       1993       2001.0
4    Barack Obama 1961-08-04       2009       2017.0

2) Basics on pandas data frame structure

<img src="images\dataFrame_structure.png" style="float:left;width:auto;height:auto;">

3) Selecting index and column names

In [129]:
# Selecting Index labels:
display(df.index.values)

array([0, 1, 2, 3, 4], dtype=int64)

array(['Name', 'born', 'in office', 'in office.1'], dtype=object)

In [128]:
# Selecting Column names:
display(df.columns.values)

array(['Name', 'born', 'in office', 'in office.1'], dtype=object)

4) Change column names

In [130]:
#Creating dictionary with a map of correct names
col_dic = {'in office': 'office_start_year', 'in office.1':'office_end_year'}
#Renaming columns
df.rename(col_dic,axis=1, inplace=True)
#Other way
df.columns = ['Name','born','office_start_year','office_end_year']
df

             Name       born  office_start_year  office_end_year
0    Jimmy C@rter 2024-01-10               1977           1981.0
1    Donald Trump 1946-06-14               2017              NaN
2  George W. Bush 1946-07-06               2001           2009.0
3    Bill Clinton 1946-08-19               1993           2001.0
4    Barack Obama 1961-08-04               2009           2017.0

5) Find null values in the data frame

In [131]:
df.isnull().sum()

Name                 0
born                 0
office_start_year    0
office_end_year      1
dtype: int64

6) Replace null values

In [132]:
df['office_end_year'].fillna(0, inplace=True)
df

             Name       born  office_start_year  office_end_year
0    Jimmy C@rter 2024-01-10               1977           1981.0
1    Donald Trump 1946-06-14               2017              0.0
2  George W. Bush 1946-07-06               2001           2009.0
3    Bill Clinton 1946-08-19               1993           2001.0
4    Barack Obama 1961-08-04               2009           2017.0

7) Fix wrong values

In [133]:
#Replacing @
df['Name'] = df['Name'].str.replace("@","a")
#Replacing value in position 0 from "Name" column
df.loc[0,"Name"] = 'Jimmy Carter'
df

             Name       born  office_start_year  office_end_year
0    Jimmy Carter 2024-01-10               1977           1981.0
1    Donald Trump 1946-06-14               2017              0.0
2  George W. Bush 1946-07-06               2001           2009.0
3    Bill Clinton 1946-08-19               1993           2001.0
4    Barack Obama 1961-08-04               2009           2017.0